{
  "Resume": "Resume",
  "Home": "Home",
  "Projects": "Projects",
  "Education and Skills": "Education and Skills",
  "Hi, I'm": "Hi, I'm",
  "About me": "About me",
  "Name:": "Name:",
  "Birth Date:": "Birth Date:",
  "Birth Place:": "Birth Place:",
  "Nacionality:": "Nacionality:",
  "Driving license:": "Driving license:",
  "Langs:": "Langs:",
  "Download resume": "Download resume",
  "Hire me": "Hire me",
  "Education": "Education",
  "Skills": "Skills",
  "Technologies": "Technologies",
  "Get in touch": "Get in touch",
  "Your name": "Your name",
  "Your email": "Your email",
  "Your phone": "Your phone",
  "Your company": "Your company",
  "Message": "Message",
  "Copyright 2018 All rights reserved. Designed and developed by Alberto Otero": "Copyright 2018 All rights reserved. Designed and developed by Alberto Otero",
  "Others": "Others",
  "Other skills": "Other skills",
  "Telecommunications": "Telecommunications",
  "Services and protocols": "Services and protocols",
  "THIS IS A LIVE PRINTING SYSTEM. Generating view... Print to pdf when it finishes!": "THIS IS A LIVE PRINTING SYSTEM. Generating view... Print to pdf when it finishes!",
  "Blog": "Blog",
  "Soon": "Soon",
  "Your password": "Your password",
  "Login": "Login",
  "Logout": "Logout",
  "Copied!": "Copied!",
  "Copy": "Copy",
  "Bitcoin Wallet": "Bitcoin Wallet",
  "Ethereum Wallet": "Ethereum Wallet",
  "All fields are required": "All fields are required",
  "User does not exist.": "User does not exist.",
  "Missing required parameter USERNAME": "All fields are required",
  "Incorrect username or password.": "Incorrect username or password.",


  "This is my cornerstone": "This is my cornerstone",
  "cornerstone1": "Firstable, had to say that <b>ALL the programming and server-based work showed here are FULLY designed and developed by me.</b>",
  "cornerstone2": "<b>RianxoSenCabos</b> was a non-profit technology and wireless networking association that consisted of a metropolitan area network <b>(MAN) of +100km2</b>, wich I've mainly manage and develop over the years, based in 3.4Ghz and 5Ghz wifi access points. Initialy was just a network to give internet connection to rural areas without a public infrastructure, and to share contents and knoledge between the members (clients), but it becomes in something just way bigger at the time <b>I fully developed</b> from a captive portal to a bunch of services in a central server, just as:",
  "ownsocial": "<b>Own social network</b>, based in a <a href=\"https://diasporafoundation.org/\">Diaspora Pod</a>",
  "mailserver": "<b>Email server and webclient</b> with Postfix, Sendmail, Dovecot, Spamassassin, Roundcube",
  "personalcloud": "<b>Personal cloud</b> storage with",
  "utorrent": "<b>Utorrent Server</b> and own developed <b>webportal</b> to search and download items in our own site",
  "streamingserver": "<b>Streaming server</b> with <a href=\"https://www.subsonic.org/\">Subsonic</a>, to stream andy downloaded content, besides of each client private Owncloud storage files",
  "clientside":
    "<b>Client-side administration portal</b>, to see transfer stats, access data, signal of your wifi conection, and PayPal integrated payments (the associacion had a subscription fee of 16€/month)",
  "adminside":
    "<b>Admin-Side administration portal</b>, where we can see transfer details of clients, devices conected (by mac), signals, and where we can banned, send warnings, etc...",
  "allofthis": "All of this working with:",
  "customized": "Customized <a href=\"https://openwrt.org/\">OpenWRT</a> distro at the wireless end-points and <a href='https://coova.github.io/'>Coova</a> captive portal",
  "against": "Against a <b>RADIUS server</b> backed with <a href='https://freeradius.org/'>FreeRADIUS</a> in a MySQL database",
  "paypalreg": "Registration by invite or <b>PayPal automatic payment system</b>",
  "allhosted": "All hosted in an own <a href=\"https://www.debian.org/\">Debian</a><span translate> server with <b>RAID 10 storage system</b>, with 3 LANS (internal network and 2 different internet connections)",
  "secondaryserver":
    "Secondary server <b>(emergency server)</b> in another location included in the network as well as with a third internet conection",
  "admansys": "Admin and management system",
  "admin1": "Our <b>admin panel</b> consisted in a series of scripting that <b>unified the wireless session of each member on our access points (AP's) with a mysql database</b> where we share data among all our services (from social network to utorrent gui). In addition, <b>our server scrapped AP stats</b> (from live clients power&noise to devices connected, macs...) and checked they status every minute, to control members bandwitch use and online time of each one. In the admin panel, <b>members could see her live SNR, bandwitch, they devices history, user data and password, accounting status...</b>. I even developed a payment gate through paypal so they can just set a monthly automatic payment or pay when they want. The server banned each slow payer member after 15 days of delay.",
  "admin2": "We, as admins, had a little different panel where to see the info of all clients in one page, and where we were able to <b>ban, renew, and manage every member</b>, besides been able to get any information of they sessions, devices, bandwitch... etc We also had a page to see last 24h of the AP's online status history in a graphical way.",
  "admin3": "The scripting beyond all of that was made in PHP and helped with some UNIX bash scripts in cron tasks.",
  "RsC Portal": "RsC Portal",
  "portal1": "All members had an account on <b>RsC Portal</b>, where the captive portal redirects them after a successful login. It had a <b>main page with an embedded search engine</b> (by google) and an few customizable <b>quick access links</b> (fully implemented by myself in PHP), and a <b>pod of the Diaspora project (social-network)</b>, a kind of, let's say, a facebook but internal only with the members. There we could <b>entabling a conversation or post news, articles...</b> or whatever. I <b>developed also all the scripting to unify the different login services</b> (Diaspora, the Radius Server, the Web Portal, Owncloud, Subsonic, Utorrent, Webmail...), you just had to register as a member from our website to access all services with one <b>unique session</b>. All this in <b>PHP, using JavaScript calls from the Login page to each service</b> and getting the cookies of the sessions in the background, at the same time a new session was generated in the access point and the portal.",
  "Personal email": "Personal email",
  "email1": "With an <b>own mail system</b> at the main server, (iRedmail/Postfix/Sendmail/Dovecot/SpamAssassin) we provided all our members with a <b>hisusername@rianxosencabos.com</b> email address, and through the portal they could access vía web (Roundcube) to they messages, as well as they could use their personal computer clients through IMAP or POP3.",
  "Cloud storage": "Cloud storage",
  "cloud1": "We provided <b>+50Gb of cloud storage</b> to each member in our OnwCloud (a Dropbox/GDrive/OneDrive open-source webapp). We had a few folders accessible to all members where they share anything they wanted to.",
  "cloud2": "Our Owncloud was also <b>customized by me, adding an streaming web system (subsonic)</b> where the members could see any multimedia content hosted on his Cloud accounts or in the shared folders. We also provided an uTorrent server with the correspondent webclient, where members could download any p2p content directly to the shared folders.",

  "This is a": "This is a",
  "project": "project",
  "withapi": "With an <b>API by DJango REST API</b>",
  "internalstats": "It uses <b>internal stats</b> seeded daily by mysportsfeeds.com API",
  "frontend": "Frontend is mented to be created in <b>Vue.js or React</b> (there is just the backend right now)",
  "prealpha": "Backend in <b>functional prealpha version</b>",
  "What is exactly ComuNiBA?": "What is exactly ComuNiBA?",
  "(final name pending)": "(final name pending)",
  "comunibadesc": "<b>ComuNiBA is a basketball (NBA) online manager</b> based on real-life stats. Pretty similar to a Fantasy but with not exactly the same behaviour. It's more like a \"<a href=\"http://www.comunio.es/\">Comunio</a>\" based game. There are a market that release players every X days as auctions, where the users can place bids in order to get the player into his team. The user configures his team with the players winned in the auctions and bought to another players. Every week, depending on the points your players scored, you will gain points and money to grow up with your team. Thats the basic behaviour, but obviously there are so much features, like exchanges, sales to \"computer\", team and player live stats, user and team configs, league configs, etc...",
  "Sources are private": "Sources are private",
  "private": "Sorry to tell that, but <b>this is a personal business project</b>, so the sources are not available publicly",

  "This is": "This is",
  "notstatic": "This is not just a static website. Neither a prebuild template. This is:",
  "fullmean": "<b>Full MEAN Stack</b> development",
  "seeded": "Seeded by a backend with a <b>REST API by MongoDB + Express + Node</b>",
  "angfrontend": "Frontend with <b>Angular 6</b>",
  "hostedaws": "Hosted at <b>AWS (Amazon Web Services)</b>.",
  "cognitoforuser": "<b>Amazon Cognito® auth system implemented</b> for user managing",
  "designedboots": "Designed with <b>HTML5, CSS3 and Bootstrap by MDBootsrap</b>",
  "brandingandlogo": "<b>Branding</b> and logo design",
  "Why this project": "Why this project",
  "aodesc1": "I feel like I'm not a common engineer, and like I wasn't a common student. I suppose that the idea which comes to your mind tinking on a non-experienced engineer is probably the typical profile of a guy without a real knowledge of the sector as it really is or someone who knows strictly what he studied and without real understanding of the subject's contents. <b>I consider myself like just the opposite</b>, a guy who needs to have <b>full understanding on the roots or the basis of every subject I dive into</b>, who <b>enjoy learning on his own as much as possible</b>, and who <b>enjoy programing and computer science</b> in general, and <b>has already serious skills and knoledge of languages and subjects far away from college</b>. My mind is not about get to know how to solve a problem mecanically or by a random method, but <b>know his basis and figure out the solution</b>.",
  "aodesc2": "So I thought: <b>what would be the better way to show it?</b> to prove that skills or that way of thinking? What better way than create a full web page, from the logo and template design to the backend, with <b>technologies and frameworks currently in trend</b> and at the top of the market? MEAN, AWS, Continuous Integration, NoSQL, REST, Cognito, Jenkins...",
  "aodesc3": "That's how <a href=\"#\">aotero.com</a>  born and why you can see this. <b>Hope you capture the feel I'm trying to show :)</b>",
  "Checkout from Github": "Checkout from Github",
  "copyrighted": "The project <b>is copyrighted but public</b> so you can check out the full code on github at the following repo:"

}
