{
  "Resume": "Ficha",
  "Home": "Inicio",
  "Projects": "Proyectos",
  "Education and Skills": "Educacion y habilidades",
  "Hi, I'm": "Hola, soy",
  "About me": " Sobre mi",
  "Name:": "Nombre:",
  "Birth Date:": "Fecha nac:",
  "Birth Place:": "Lugar nac:",
  "Nacionality:": "Nacionalidad:",
  "Driving license:": "Carnet de conducir:",
  "Langs:": "Idiomas:",
  "Download resume": "Descargar currículum",
  "Hire me": "Contrátame",
  "Education": "Educación",
  "Skills": "Habilidades",
  "Technologies": "Tecnologías",
  "Get in touch": "Ponte en contacto",
  "Your name": "Nombre",
  "Your email": "Email",
  "Your phone": "Teléfono",
  "Your company": "Empresa",
  "Message": "Mensaje",
  "Copyright 2018 All rights reserved. Designed and developed by Alberto Otero": "Copyright 2018 Todos los derechos reservados. Diseñado y desarrollado por Alberto Otero",
  "Others": "Otros",
  "Other skills": "Otras aptitudes",
  "Telecommunications": "Telecomunicaciones",
  "Services and protocols": "Servicios y protocolos",
  "THIS IS A LIVE PRINTING SYSTEM. Generating view... Print to pdf when it finishes!": "Esto es una impresión en vivo. Generando vista... Imprime como pdf cuando termine!",
  "Blog": "Blog",
  "Soon": "Muy pronto",
  "Your password": "Contraseña",
  "Login": "Login",
  "Logout": "Salir",
  "Copied!": "Copiado!",
  "Copy": "Copiar",
  "Bitcoin Wallet": "Cartera Bitcoin",
  "Ethereum Wallet": "Cartera Ethereum",
  "All fields are required": "Todos los campos son obligatorios",
  "User does not exist.": "El usuario no existe.",
  "Missing required parameter USERNAME": "Todos los campos son obligatorios",
  "Incorrect username or password.": "Nombre de usuario o contraseña incorrectos.",


  "This is my cornerstone": "Mi piedra angular",
  "cornerstone1": "Primero de nada, me gustaría dejar claro que <b>todo el desarrollo, programación, y mantenimiento del código y de los servidores aquí mencionados están TOTALMENTE realizados por mi</b>",
  "cornerstone2": "<b>RianxoSenCabos</b> era una asociación sin ánimo de lucro para el desarrollo wifi y de las nuevas tecnologías, que consistía en una red de área metropolitana <b>(MAN) de +100km2</b>, la cual gestioné y desarrollé durante años. Basada en puntos de acceso wifi de las bandas de 3.4Ghz y 5Ghz. Inicialmente fue concebida como una red para dar acceso a internet en areas rurales sin infraestructura pública y para compartir contenido y conocimientos entre los socios, pero se convirtió en algo mucho mayor con el tiempo. <b>He desarrollado</b> desde un portal cautivo a una buena gama de servicios en un servidor central, como por ejemplo:",
  "ownsocial": "<b>Red social propia</b>, con un <a href=\"https://diasporafoundation.org/\">Diaspora Pod</a>",
  "mailserver": "<b>Servidor de correo y cliente web </b> con Postfix, Sendmail, Dovecot, Spamassassin, Roundcube",
  "personalcloud": "<b>Almacenamiento personal en la nube con</b> Owncloud",
  "utorrent": "<b>Utorrent Server</b> y un servicio propio de búsqueda y descarga de torrents directamente en nuestros servidores sin páginas de terceros",
  "streamingserver": "<b>Servidor de streaming</b> con <a href=\"https://www.subsonic.org/\">Subsonic</a>, con el cual hacer streaming tanto del contenido común, como de los archivos multimedia de la nube de cada socio",
  "clientside":
  "<b>Panel de control para socios</b> donde ver estadísticas de transferencia, datos de acceso y usuario, SNR en directo de la conexión wifi, y gestión de pagos automátizados con PayPal (la asociación tenía una cuota de unos 16€/mes)",
  "adminside":
  "<b>Portal de administración para administradores</b>, En el cual ver todo tipo de detalles de los clientes, como dispositivos conectados (por mac), potencia, ruido y señales, y donde poder gestionar, banear, enviar avisos, etc... a los mismos",
  "allofthis": "Todo esto junto con:",
  "customized": "Distribución personalizada y compilada desde fuentes modificadas por mi de <a href=\"https://openwrt.org/\">OpenWRT</a> en los puntos de acceso WIFI, con un portal cautivo <a href='https://coova.github.io/'>Coova</a>",
  "against": "Autenticación mediante un <b>servidor RADIUS</b> contra un sistema <a href='https://freeradius.org/'>FreeRADIUS</a> y una base de datos MySQL",
  "paypalreg": "Registro por invitación o <b>pago mediante PayPal</b>",
  "allhosted": "Todo alojado en un servidor local <a href=\"https://www.debian.org/\">Debian</a><span translate> con un sistema de almacenamiento en <b>RAID 10</b>, y 3 LANS (red interna y 2 diferentes conexiones a internet)",
  "secondaryserver":
  "Servidor secundario <b>(serivdor de emergencia)</b> en otra ubicación dentro de la red, con acceso desde una tercera ADSL",
  "admansys": "Sistema de administración y gestión",
  "admin1": "El <b>panel de administración</b> consistía en una serie de scripts  que <b>unificaban las sesiones wifi físicas de cada socio en nuestros puntos de acceso (contra una base de datos mysql)</b>, con sesiones de explorador en todo nuestro sistema (desde la red social, hasta la nube, utorrent...). Además, nuestro servidor <b>hacía scrapping en tiempo real de estadísticas y datos en los propios puntos de acceso </b> (sesiones de clientes, ruidos y señales, dispositivos conectados, macs...), y comprobaba a cada instante el estado online de los mismos, todo esto para comprobar la transferencia de los socios y AP's y los tiempos de caída de cada uno. En el panel de administración, <b>los socios podían ver el SNR con el que estaban conectados a la red en directo, datos de transferencia, historial de dispositivos, datos de usuario, estado de cuentas...</b>. Incluso implementé una pasarela de pago con paypal para que cada socio pudiese pagar directamente online, configurar un pago periódico... El server baneaba automáticamente a los socios tras 15 días de retraso en el pago.",
  "admin2": "Nosotros, como administradores, teníamos un panel un poco diferente donde ver toda la info de los socios en una única página y donde poder <b>banear, cambiar o gestionarlos </b>, además de dónde poder obtener toda su información de sesiones, dispositivos, tráfico consumido... También teniamos un dashboard donde ver el estado de operatividad de todos nuestros puntos de acceso de una forma gráfica",
  "admin3": "Toda la programación y el scripting fue hecha en PHP y Javascript, ayudada de algunos scripts en bash y apéndices en otros lenguajes.",
  "RsC Portal": "RsC Portal",
  "portal1": "Todos los miembros tenían una cuenta en <b>RsC Portal</b>, portal accesible desde internet, y que en caso de estar conectado a través de nuestros puntos de acceso servía como punto de redirección ante un login correcto. Consistía en <b>una página principal con un buscador</b>, así como en distintos links o marcadores personalizables de acceso rápido, embebida en el ecosistema de Diaspora (red social interna tipo facebook). Además <b>desarollé todo el scripting necesario para unificar los diferentes logueos y cuentas de cada uno de los servicios</b> (Diaspora, el servidor Radius, nuestro portal, Owncloud, Subsonic, Utorrent, Webmail...), solo tenías que registrarte como socio desde una página de login centralizada para acceder a todos los servicios con una <b>unica sesión</b>. Dicho scripting <b> también fue realizado en PHP usando JavaScript, JQuery y peticiones con Ajax entre la página de logueo centralizado y los distintos servicios (se que es un poco rudimentario, pero para lo que necesitabamos, funcionaba sin tener que codificar código fuente de distintos servicios en distintos lenguajes</b>. Dicho sistema de logueo también albergaba la lógica para loguear a los socios a través del portal cautivo.",
  "Personal email": "Correo electrónico personal",
  "email1": "Con un <b>servidor de correo propio</b> en nuestro servidor, y distintos servicios (iRedmail/Postfix/Sendmail/Dovecot/SpamAssassin) proveíamos a los socios con un email del tipo <b>hisusername@rianxosencabos.com</b>, al cual podían acceder vía web a través de nuestro portal (Roundcube), así como sincronizar el correo con sus propios clientes por IMAP o POP3",
  "Cloud storage": "Nube personal propia",
  "cloud1": "Ofrecíamos <b>+50Gb de almacenamiento en la nube</b> a cada socio en nuestro Owncloud (un CMS del estilo de Dropbox/GDrive/OneDrive). Teníamos también ciertas carpetas comunes accesibles a todos los socios con una cuota de espacio muy superior, donde podían compartir contenidos y descargas entre ellos (todo lo que se descargaba de nuestro utorrent iba a parar a ellas)",
  "cloud2": "Nuestro owncloud también fue <b>modificado por mi, añadiéndole al mismo un sistema de streaming (Subsonic)</b> donde los miembros podían ver cualquier contenido multimedia tanto de su nube como de las carpetas comunes a través del portal. Como he mencionado antes, también proveíamos un servidor uTorrent con su correspondiente webgui multiusuario, para descargar contenidos p2p directamente a las carpetas comunes.",

  "This is a": "Esto es",
  "project": "",
  "withapi": "Con una <b>API con DJango REST API</b>",
  "internalstats": "Usa <b>estadísticas</b> proveídas diariamente y en directo por la API de mysportsfeeds.com",
  "frontend": "El frontend está pensado para hacerse en <b>Vue.js o React</b> (actualmente solo está desarrollado el backend)",
  "prealpha": "El backend está en un punto avanzado con una <b>versión prealfa totalmente funcional</b>",
  "What is exactly ComuNiBA?": "Que és ComuNiBA?",
  "(final name pending)": "(nombre pendiente de rev)",
  "comunibadesc": "<b>ComuNiBA es un manager online de baloncesto (NBA)</b> basado en estadísticas reales. Se puede decir que es similar a un Fantasy pero no exactamente con el mismo comportamiento. Algo más como un \"<a href=\"http://www.comunio.es/\">Comunio</a>\". Existe un mercado en el que se van publicando subastas de jugadores, donde los usuarios tienen la posibilidad de pujar para hacerse con ellos. El usuario va creando un equipo con los jugadores ganados en dichas pujas y comprados a otros jugadores. Cada semana, dependiendo de las actuaciones de cada jugador en la vida real, se ganarán puntos y dinero para poder ir avanzando en el juego. Este es el resumen básico, pero obviamente existen muchas más características, como intercambios de jugadores, ventas al propio \"computer\", estadisticas en directo de jugadores y equipos, distintas opciones de configuración de equipo y liga, etc...",
  "Sources are private": "El código fuente es privado",
  "private": "Lo siento, pero <b>esto es un proyecto personal con espectativas de negocio</b>, por lo que el código fuente no está accesible de forma pública",

  "This is": "Esto es",
  "notstatic": "Esto no es simplemente un sitio web estático. Tampoco un template prefabricado. Esto es:",
  "fullmean": "Un desarrollo <b>Full MEAN Stack</b>",
  "seeded": "Backend con una <b>REST API by MongoDB + Express + Node</b>",
  "angfrontend": "Frontend en <b>Angular 6</b>",
  "hostedaws": "Alojado en <b>AWS (Amazon Web Services)</b>.",
  "cognitoforuser": "Sistema de autenticación implementado con <b>Amazon Cognito®</b> para la gestión de usuarios/sesiones",
  "designedboots": "Diseñado con <b>HTML5, CSS3 y Bootstrap (MDBootsrap)</b>",
  "brandingandlogo": "<b>Diseño de marca</b> y logo",
  "Why this project": "Por qué este proyecto",
  "aodesc1": "Siento que no soy un ingeniero común, que no he sido un estudiante común. Supongo que la idea que se viene a la cabeza cuanto hablamos de ingenieros sin experiencia es probablemente el estereotipo de persona sin conocimiento real del sector tal y como es, o alguien que sabe estrictamente lo que ha estudiado, sin entendimiento real de los contenidos de cada materia y sus aplicaciones. <b>Me considero justo lo contrario</b>, una persona que necesita <b>entender completamente las raíces y las bases de todo aquello en lo que me sumerjo</b>, alguien que <b>disfruta creciendo por si mismo y abriéndose a todo tipo de contenidos</b>, que <b>disfruta de la programación y de los ordenadores en general</b> y <b>con ciertas aptitudes importantes y conocimiento de multiples lenguajes y frameworks, más allá de lo impartido en la universidad</b>. Mi mente no es de las que se conforman con resolver un problema o superar un reto de forma mecánica o casual, sino que necesita <b>conocer las bases del mismo y dar con la solución adecuada por medio de la lógica</b>.",
  "aodesc2": "Así que pensé: <b>¿que mejor forma de mostrar mis aptitudes?</b> ¿que mejor forma de denotar mi forma de pensar? Pues qué mejor que diseñar y desarrollar esta página web, desde el logo y el template hasta el backend, con <b>tecnologías y frameworks en tendencia</b>? MEAN, AWS, Integración continua, NoSQL, REST, Cognito, Jenkins...",
  "aodesc3": "Así es como <a href=\"#\">aotero.com</a> nace y el por qué de que estés leyendo esto. <b>Espero que logres ver las aptitudes que intento enseñar con ello :)</b>",
  "Checkout from Github": "Échale un ojo en Github",
  "copyrighted": "Este proyecto <b>tiene copyright pero es público</b> por lo que puedes pasarte por Github para ver en primera persona todo el código fuente desde el siguiente repo:"
}
