{
  "Resume": "Ficha",
  "Home": "Inicio",
  "Projects": "Proxectos",
  "Education and Skills": "Educacion e habilidades",
  "Hi, I'm": "Ola, son",
  "About me": " Sobre min",
  "Name:": "Nome:",
  "Birth Date:": "Fecha nac:",
  "Birth Place:": "Lugar nac:",
  "Nacionality:": "Nacionalidade:",
  "Driving license:": "Carné de conducir:",
  "Langs:": "Linguas:",
  "Download resume": "Descargar currículo",
  "Hire me": "Contrátame",
  "Education": "Educación",
  "Skills": "Habilidades",
  "Technologies": "Tecnoloxías",
  "Get in touch": "Ponte en contacto",
  "Your name": "Nome",
  "Your email": "Email",
  "Your phone": "Teléfono",
  "Your company": "Empresa",
  "Message": "Mensaxe",
  "Copyright 2018 All rights reserved. Designed and developed by Alberto Otero": "Copyright 2018 Todos os dereitos reservados. Diseñado e desenrolado por Alberto Otero",
  "Others": "Outros",
  "Other skills": "Outras aptitudes",
  "Telecommunications": "Telecomunicacións",
  "Services and protocols": "Servizos e protocolos",
  "THIS IS A LIVE PRINTING SYSTEM. Generating view... Print to pdf when it finishes!": "Isto é unha impresión en vivo. Xerando vista... Imprime como pdf cando remate!",
  "Blog": "Blog",
  "Soon": "Moi pronto",
  "Your password": "Contrasinal",
  "Login": "Login",
  "Logout": "Saír",
  "Copied!": "Copiado!",
  "Copy": "Copiar",
  "Bitcoin Wallet": "Moedeiro Bitcoin",
  "Ethereum Wallet": "Moedeiro Ethereum",
  "All fields are required": "Todos os campos son obrigatorios",
  "User does not exist.": "O usuario non existe.",
  "Missing required parameter USERNAME": "Todos os campos son obrigatorios",
  "Incorrect username or password.": "Nome de usuario ou contrasinal incorrectos.",

  "This is my cornerstone": "A miña pedra angular",
  "cornerstone1": "Primeiro de nada, gustaríame deixar claro que <b>todo o desenvolvemento, a programación, e o mantenimiento do código e dos servidores aquí mencionados están TOTALMENTE realizados por min</b>",
  "cornerstone2": "<b>RianxoSenCabos</b> era una asociación sen ánimo de lucro para o desenvolvemento wifi e das novas tecnoloxías, que consistía nunha rede de área metropolitana <b>(MAN) de +100km2</b>, a cal xestionei, desenvolvín e mantiven durante anos. Basada en puntos de acceso wifi das bandas de 3.4Ghz e 5Ghz. Inicialmente foi concebida como unha rede para dar acceso a internet en areas rurales sen infraestructura pública e para compartir contidos e coñecementos entre os socios, pero foise convertindo en algo moito maior co tiempo. <b>Desenvolvín</b> dende un portal cautivo a unha boa gama de servizos en un servidor central, como por exemplo:",
  "ownsocial": "<b>Rede social propia</b>, con un <a href=\"https://diasporafoundation.org/\">Diaspora Pod</a>",
  "mailserver": "<b>Servidor de correo e cliente web </b> con Postfix, Sendmail, Dovecot, Spamassassin, Roundcube",
  "personalcloud": "<b>Almacenamento persoal na nube con</b> Owncloud",
  "utorrent": "<b>Utorrent Server</b> e un servizo propio de búsqueda e descarga de torrents directamente nos nosos servidores, sen entrar en páxinas de terceiros",
  "streamingserver": "<b>Servidor de streaming</b> con <a href=\"https://www.subsonic.org/\">Subsonic</a>, co cal facer streaming tanto do contido común, como dos arquivos multimedia da nube de cada socio",
  "clientside":
  "<b>Panel de control para socios</b> donde ver estadísticas de transferencia, datos de acceso e usuario, SNR en directo da conexión wifi, e xestión de pagos automátizados con PayPal (a asociación esixía unha cuota de uns 16€/mes)",
  "adminside":
  "<b>Portal de administración</b>, no cal ver todo tipo de detalles dos socios, como dispositivos conectados (por mac), potencia, ruido e sinais, e donde poder xestionar, banear, enviar avisos, etc... aos mesmos",
  "allofthis": "Todo isto xunto con:",
  "customized": "Distribución personalizada e compilada dende fontes modificadas por min de <a href=\"https://openwrt.org/\">OpenWRT</a> nos puntos de acceso WIFI, con un portal cautivo <a href='https://coova.github.io/'>Coova</a>",
  "against": "Autenticación mediante un <b>servidor RADIUS</b> contra un sistema <a href='https://freeradius.org/'>FreeRADIUS</a> e unha base de datos MySQL",
  "paypalreg": "Rexistro por invitación ou <b>pago mediante PayPal</b>",
  "allhosted": "Todo aloxado nun servidor local <a href=\"https://www.debian.org/\">Debian</a><span translate> con un sistema de almacenamento en <b>RAID 10</b>, e 3 LANS (rede interna e 2 diferentes conexións a internet)",
  "secondaryserver":
  "Servidor secundario <b>(serivdor de emerxencia)</b> en outra ubicación dentro da rede, con acceso dende una terceira ADSL",
  "admansys": "Sistema de administración e xestión",
  "admin1": "O <b>panel de administración</b> consistía nunha serie de scripts que <b>unificaban as sesións wifi físicas de cada socio nos nosos puntos de acceso (contra una base de datos mysql)</b>, con sesións de explorador en todo o noso sistema (desde a rede social, hasta a nube, o utorrent...). Ademáis, o noso servidor <b>facía scrapping en tempo real de estadísticas e datos nos propios puntos de acceso </b> (sesións de clientes, ruidos e sinais, dispositivos conectados, macs...), e comprobaba a cada instante o estado online de los mismos, todo isto para poder comprobar o consumo de datos dos socios e AP's e os tempos de caída de cada un. No panel de administración, <b>os socios podían ver o SNR co que estaban conectados á rede en tempo real, datos de transferencia, historial de dispositivos, datos de usuario, estado das contas...</b>. Incluso implementei unha pasarela de pago con paypal para que cada socio poidese pagar directamente online, configurar un pago periódico... O servidor baneaba automáticamente aos socios tras 15 días de retraso no pago.",
  "admin2": "Nos, como administradores, tiñamos un panel un pouco diferente onde ver toda a información dos socios en una única páxina e onde poder <b>banear, cambiar o xestionar todo </b>, ademáis de onde poder obter toda a súa información de sesións, dispositivos, tráfico consumido... Tamén tiñamos un dashboard onde ver o estado de operatividad de todos os nosos puntos de acceso de una forma gráfica",
  "admin3": "Toda a programación e o scripting foi realizado en PHP e Javascript, axudada por algúns scripts en bash e apéndices en outras linguaxes.",
  "RsC Portal": "RsC Portal",
  "portal1": "Todos os membros tiñan unha conta en <b>RsC Portal</b>, portal accesible dende internet, e que en caso de estar conectado a través dos nosos puntos de acceso, servía coma punto de redirección ante un login correcto. Consistía <b>nunha página principal con un buscador</b>, así como en distintos links ou marcadores personalizables de acceso rápido, embebida no ecosistema de Diaspora (rede social interna tipo facebook). Además <b>desenvolvín todo o scripting necesario para unificar os diferentes logueos e contas de cada un dos servizos</b> (Diaspora, o servidor Radius, o noso portal, Owncloud, Subsonic, Utorrent, Webmail...), solo tiñas que rexistrarte como socio dende una páxina de login centralizada para acceder a todos os servizos con unha <b>unica sesión</b>. Dito scripting <b> tamén foi realizado en PHP usando JavaScript, JQuery e peticións con Ajax entre a páxina de logueo centralizado e os distintos servizos (sei que é un pouco rudimentario, pero para o que necesitabamos, funcionaba sin tener que codificar código fonte de distintos servizos en distintas linguaxes</b>. Dito sistema de logueo tamén albergaba a lóxica para loguear aos socios a través do portal cautivo.",
  "Personal email": "Correo electrónico persoal",
  "email1": "Con un <b>servidor de correo propio</b> no noso servidor, e distintos servizos (iRedmail/Postfix/Sendmail/Dovecot/SpamAssassin) proveíamos aos socios con un email do tipo <b>hisusername@rianxosencabos.com</b>, ao cal podían acceder vía web a través do noso portal (Roundcube), así como sincronizar o correo cos seus propios clientes por IMAP ou POP3",
  "Cloud storage": "Nube persoal propia",
  "cloud1": "Ofrecíamos <b>+50Gb de almacenamiento na nube</b> a cada socio no noso Owncloud (un CMS do estilo de Dropbox/GDrive/OneDrive). Tiñamos tamén certas carpetas comúns accesibles a todos os socios con unha cuota de espacio moi superior, onde podían compartir contidos e descargas entre eles (todo o que se descargaba do noso utorrent iba a parar alí)",
  "cloud2": "O noso owncloud tamén foi <b>modificado por mim, añadíndolle ao mesmo un sistema de streaming (Subsonic)</b> onde os socios podían ver calquier contido multimedia tanto da súa nube como das carpetas comúns a través do portal. Como mencionei antes, tamén províamos un servidor uTorrent co seu correspondente webgui multiusuario, para descargar contidos p2p directamente ás carpetas comúns.",

  "This is a": "isto é un",
  "project": "proxecto",
  "withapi": "Con unha <b>API con DJango REST API</b>",
  "internalstats": "Usa <b>estadísticas</b> proveídas diariamente e en directo pola API de mysportsfeeds.com",
  "frontend": "O frontend está pensado para facerse en <b>Vue.js ou React</b> (actualmente solo está programado o backend)",
  "prealpha": "O backend está nun punto avanzado con unha <b>versión prealfa totalmente funcional</b>",
  "What is exactly ComuNiBA?": "Que é ComuNiBA?",
  "(final name pending)": "(nome pendente de rev)",
  "comunibadesc": "<b>ComuNiBA é un manager online de baloncisto (NBA)</b> basado en estadísticas reais. Pódese dicir que é similar a un Fantasy pero non exactamente co mismo comportamento. Algo máis como un \"<a href=\"http://www.comunio.es/\">Comunio</a>\". Existe un mercado no que se van publicando subastas de xogadores, onde os usuarios teñen a posibilidade de puxar para facerse con eles. O usuario vai creando un equipo cos xogadores gañaados nas devanditas puxas e comprados a outros xogadores. Cada semana, dependendo das actuacións de cada xogador na vida real, ganaránse puntos e diñeiro para poder ir avanzando no xogo. Este é o resumen básico, pero obviamente existen moitas máis características, como intercambios de xogadores, ventas ao propio \"computer\", estadisticas en directo de xogadores e equipos, distintas opcións de configuración de equipo e liga, etc...",
  "Sources are private": "O código fonte es privado",
  "private": "Sintoo, pero <b>isto é un proxecto persoal con espectativas de negocio</b>, polo que o código fonte non está accesible de forma pública",

  "This is": "isto é",
  "notstatic": "isto non é simplemente un sitio web estático. Tampoco un template prefabricado. isto é:",
  "fullmean": "Un aplicativo <b>Full MEAN Stack</b>",
  "seeded": "Backend con unha <b>REST API by MongoDB + Express + Node</b>",
  "angfrontend": "Frontend en <b>Angular 6</b>",
  "hostedaws": "Aloxado en <b>AWS (Amazon Web Services)</b>.",
  "cognitoforuser": "Sistema de autenticación implementado con <b>Amazon Cognito®</b> para a xestión de usuarios/sesións",
  "designedboots": "Diseñado con <b>HTML5, CSS3 e Bootstrap (MDBootsrap)</b>",
  "brandingandlogo": "<b>Diseño de marca</b> e logo",
  "Why this project": "Por qué este proxecto",
  "aodesc1": "Sinto que non son un enxeñeiro común, que non fun un estudante común. Supoño que a idea que se ven á cabeza cando falamos de enxeñeiros sen experiencia é probablemente o estereotipo de persoa sen conocemento real do sector tal e como é, ou alguén que sabe estrictamente o que estudiou, sen entendemento real dos contidos de cada materia e as súas aplicacións. <b>Considerome xusto o contrario</b>, unha persoa que necesita <b>entender completamente as raíces e as bases de todo aquilo no que me sumerxo</b>, alguén que <b>disfruta crecendo por si mesmo e abríndose a todo tipo de contidos</b>, que <b>disfruta da programación e dos ordenadores en xeral</b> e <b>con certas aptitudes importantes e coñecemento de multiples linguaxes e frameworks, máis alá do impartido na universidade</b>. A miña mente non é das que se conforman con resolver un problema ou superar un reto de forma mecánica ou casual, senon que necesita <b>coñecer as bases do mesmo e dar coa solución adecuada por medio da lóxica</b>.",
  "aodesc2": "Así que pensei: <b>¿que mellor forma de mostrar as miñas aptitudes?</b> ¿que mellor forma de denotar a miña forma de pensar? Pois qué mellor que deseñar y desenvolver esta páxina web, dende o logo e o template ata o backend, con <b>tecnoloxías e frameworks en tendencia</b>? MEAN, AWS, Integración continua, NoSQL, REST, Cognito, Jenkins...",
  "aodesc3": "Así é como <a href=\"#\">aotero.com</a> nace e o por qué de que estés lendo isto. <b>Espero que logres ver as aptitudes que intento mostrar con ela :)</b>",
  "Checkout from Github": "Bótalle in ojo no Github",
  "copyrighted": "Este proxecto <b>ten copyright pero é público</b> polo que podes pasarte polo Github para ver en primera persoa todo o código fonte dende o seguinte repo:"
}
